Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །གྲོང་ཁྱེར་ནག་པོ་རོ་ཧི་ཏ།
en: The City of Kāla, Rohitaka,

source: །གསིང་མ་ཅན་དང་དེ་བཞིན་དུ།
en: Śādvalā, and

source: །དགའ་བ་འཕེལ་བས་ཚོགས་སུ་ནི།
en: Nandivardhana.

source: །བྱས་ཏེ་ཡང་དག་བརྗོད་པ་ཡིན།
en: These are correctly explained. I.

source: །བཅོམ་ལྡན་འདས་ཀིམ་པི་ལར་བྱོན་ནས་ཀིམ་པི་ལའི་ནགས་ཁྲོད་ན་བཞུགས་སོ།
en: Kimpilā The Blessed One arrived in Kimpilā and stayed in Kimpilā Forest.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀིམ་པི་ལ་ལ་བཀའ་སྩལ་པ། ཀིམ་པི་ལ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་བརྩམས་ཏེ་བསྒོམ་པ་ཁྱོད་ལ་བཤད་ཀྱིས།
en: Thereupon the Blessed One said to the venerable Kimpila, “O Kimpila, I will teach you to meditate on the four applications of mindfulness.

source: དེ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ་ཞེས་དེ་སྐད་བཀའ་སྩལ་པ་ན།
en: Listen to it well and keep it in mind; I shall teach it.”

source: ཚེ་དང་ལྡན་པ་ཀིམ་པི་ལ་ཅང་མི་སྨྲའོ།
en: When the Blessed One had said this, the venerable Kimpila remained silent.

source: །ལན་གཉིས་སུ་ཡང་དེ་བཞིན། ལན་གསུམ་དུ་ཡང་དེ་བཞིན་བརྗོད་པར་བྱའོ།
en: He remained so when the Blessed One said it a second time and a third time.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ཚེ་དང་ལྡན་པ་ཀིམ་པི་ལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཀིམ་པི་ལ་ཁྱོད་ལ་སྟོན་པ་གསུང་ངོ་།
en: Then the venerable Ānanda said to the venerable Kimpila, “Venerable Kimpila, the Teacher is speaking to you.”

source: །ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་འཚལ་ཏོ།
en: “I know, O Venerable Ānanda.

source: །ཚེ་དང་ལྡན་པ་གཽ་ཏ་མ་རབ་ཏུ་འཚལ་ཏོ།
en: I know well, O Venerable Ānanda.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེའི་དུས་ལ་བབ་ལགས་སོ།
en: Then the venerable Ānanda said to the Blessed One, “O Blessed One, it is the right time.

source: །བདེ་བར་གཤེགས་པ་དེའི་དུས་ལ་བབ་ལགས་ཏེ།
en: O Sugata, it is the right time.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལས་བརྩམས་ཏེ་བསྒོམ་པ་བཤད་ན། དེའི་སླད་དུ་དགེ་སློང་རྣམས་ཀྱིས་ཐོས་ནས་འཛིན་པར་འགྱུར་ལགས་སོ།
en: If the Blessed One teaches the monks to meditate on the four applications of mindfulness, the monks will listen to it and grasp it.”

source: །ཀུན་དགའ་བོ་དེའི་ཕྱིར་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: “Ānanda, then listen to it well and keep it in mind; I shall teach it.

source: །འདི་ལ་དགེ་སློང་གང་ཡང་གྲོང་དང་གྲོང་རྡལ་ཞེས་བྱ་བ་དང་། དྲན་བཞིན་དུ་དབུགས་བརྔུབས་ན་དབུགས་བརྔུབས་སོ་ཞེས་སློབ་སྟེ་ཞེས་བྱ་བ་ནས། འགོག་པའི་རྗེས་སུ་ལྟ་ཞིང་དབུགས་ཕྱུང་བ་སློབ་སྟེ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Here a monk, in a village or town . . . when he has mindfully breathed in, he knows that he has breathed in . . . . He knows that he has breathed out, observing cessation.

source: །གང་གི་ཚེ་འཕགས་པའི་ཉན་ཐོས་དྲན་བཞིན་དུ་དབུགས་བརྔུབས་ན། དྲན་བཞིན་དུ་དབུགས་བརྔུབས་སོ་ཞེས་སློབ་པ་ཞེས་བྱ་བ་ནས། ལུས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་ཏེ་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་དབུགས་ཕྱུང་ངོ་ཞེས་སློབ་སྟེ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེའི་ཚེ་འཕགས་པའི་ཉན་ཐོས་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་སོ།
en: “When a noble disciple, having mindfully breathed in, knows that he has mindfully breathed in . . . he knows that he has, with his bodily formations made supple, breathed out, observing the body in the body, the noble disciple dwells, observing the body in the body.

source: །དེའི་ཚེ་འཕགས་པའི་ཉན་ཐོས་གནས་པ་ན་ནང་གི་ཡིད་ལ་བྱེད་པ་ཡོད་པར་ཤེས་སོ།
en: When he thus dwells, the noble disciple knows that his mind is concentrated inwardly.

source: །ཀུན་དགའ་བོ་དཔེར་ན་ལམ་པོ་ཆེའི་བཞི་མདོར་རྡུལ་གྱི་མཆོད་རྟེན་ཞིག་བརྩིགས་པར་འགྱུར་ལ་དེ་ནས་ཤར་ཕྱོགས་ནས་བཞོན་པ་ཅན་ནམ། ཁྱོགས་སམ། ཤིང་རྟས་འཁྱམ་པ་ཞིག་འོངས་ན།
en: “Ānanda, suppose, for instance, a stūpa is built out of dirt at the crossroads of main streets and then someone roaming by vehicle, palanquin, or chariot comes there from the east.

source: ཀུན་དགའ་བོ་ཇི་སྙམ་དུ་སེམས།
en: What do you think, Ānanda?

source: རྡུལ་གྱི་མཆོད་རྟེན་འཇིག་པར་འགྱུར་རམ།
en: Will the dirt stūpa disintegrate?”

source: བཙུན་པ་འགྱུར་ལགས་སོ།
en: “Yes, it will, O Honored One.”

source: །དེ་བཞིན་དུ་གང་གི་ཚེ་འཕགས་པའི་ཉན་ཐོས་དྲན་བཞིན་དུ་དབུགས་བརྔུབས་སོ། །ཞེས་བྱ་བ་ནས་ནང་གི་ཡིད་ལ་བྱེད་པ་ཡོད་པར་ཤེས་པ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “In the same way, when a noble disciple learns that he has mindfully breathed in . . . he knows that his mind is concentrated inwardly.

source: །གང་གི་ཚེ་འཕགས་པའི་ཉན་ཐོས་དགའ་བ་སོ་སོར་མྱོང་བ་ཞེས་བྱ་བ་ནས། སེམས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་ཏེ་ཚོར་བ་རྣམས་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་ཞིང་དབུགས་ཕྱུང་ངོ་ཞེས་སློབ་བོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “When a noble disciple, experiencing pleasure . . . knows that he has, with his mental formations made supple, breathed out, observing perception in perception, the noble disciple dwells, observing perception in perception.

source: །དཔེར་ན་ཀུན་དགའ་བོ་ལམ་པོ་ཆེའི་བཞི་མདོར་རྡུལ་གྱི་མཆོད་རྟེན་ཞིག་བརྩིགས་པར་གྱུར་ལ། དེ་ནས་ལྷོ་ཕྱོགས་ནས་བཞོན་པ་ཅན་ནམ། ཁྱོགས་སམ། ཤིང་རྟས་འཁྱམ་པ་ཞིག་འོངས་ན་ཞེས་བྱ་བ་ནས། ཚོར་བ་རྣམས་ལ་ཚོར་བའི་རྗེས་སུ་ལྟའོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Ānanda, suppose, for instance, a stūpa is built out of dirt at the crossroads of main streets and then someone roaming by vehicle, palanquin, or chariot comes there from the south . . . observing perception in perception.

source: །གང་གི་ཚེ་འཕགས་པའི་ཉན་ཐོས་སེམས་སོ་སོར་མྱོང་བ་དང་། སེམས་རབ་ཏུ་དགའ་བ་དང་། སེམས་མཉམ་པར་འཇོག་པ་དང་སེམས་རྣམ་པར་གྲོལ་བར་བྱེད་ཅིང་དབུགས་བརྔུབས་ན་སེམས་རྣམ་པར་གྲོལ་བར་བྱེད་ཅིང་དབུགས་བརྔུབས་སོ་ཞེས་སློབ་བོ་སེམས་རྣམ་པར་གྲོལ་བར་བྱེད་ཅིང་དབུགས་ཕྱུང་ན་སེམས་རྣམ་པར་གྲོལ་བར་བྱེད་ཅིང་དབུགས་ཕྱུང་ངོ་ཞེས་སློབ་སྟེ། སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟའོ།
en: “When a noble disciple has experienced his mind and breathed in, with his mind pleased, concentrated, and liberated, he knows that he has breathed in with his mind liberated; and, having breathed out with his mind liberated, he knows that he has breathed out with his mind liberated, and he dwells, observing his mind in his mind.

source: །གང་གི་ཚེ་འཕགས་པའི་ཉན་ཐོས་གནས་པ་ན་ནང་གི་ཡིད་ལ་བྱེད་པ་ཡོད་པར་ཤེས་ཏེ་མཆོད་རྟེན་དེ་ཉིད་ལ་ནུབ་ཕྱོགས་ནས་ཞེས་དཔེར་བྱའོ།
en: When he thus dwells, the noble disciple knows that his mind is concentrated inwardly.” (The parable of the stūpa and a vehicle, and so forth, from the west should be narrated here.)

source: །དེ་ལུས་དེ་དང་ཚོར་བ་དེ་དང་སེམས་དེ་ལ་བརྣབ་སེམས་ཡིད་མི་བདེ་བ་གཉིས་ཀ་ནུབ་པས་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་བཏང་སྙོམས་སུ་གནས་སོ།
en: “Because both his longing and despair have disappeared in his body, perception, and mind, he dwells in equanimity, observing mental objects in mental objects.

source: །དེའི་ཚེ་འཕགས་པའི་ཉན་ཐོས་གནས་པ་ན་ནང་གི་ཡིད་ལ་བྱེད་པ་ཡོད་པར་ཤེས་ཏེ།
en: When he thus dwells, the noble disciple knows that his mind is concentrated inwardly.

source: དཔེར་ན་ལམ་པོ་ཆེའི་བཞི་མདོར་རྡུལ་གྱི་མཆོད་རྟེན་བརྩིགས་པར་གྱུར་ལ། དེ་ནས་བྱང་ཕྱོགས་ནས་བཞོན་པ་ཅན་ནམ་ཁྱོགས་སམ། ཤིང་རྟས་འཁྱམ་པ་ཞིག་འོངས་ན།
en: “Suppose, for instance, a stūpa is built out of dirt at the crossroads of main streets and then someone roaming by vehicle, palanquin, or chariot comes there from the north.

source: བཙུན་པ་དེ་ལྟར་འགྱུར་ལགས་སོ།
en: “Yes, it will, O Honored One.”

source: །ཞེས་བྱ་བ་ནས་དེ་ལྟར་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “In the same way . . . observing mental objects in mental objects.

source: ཀུན་དགའ་བོ་དེ་ལྟར་ན་དྲན་པ་ཉེ་བར་གཞག་པ་བཞིའི་དབང་དུ་བྱས་ཏེ། བསྒོམས་པ་ཡིན་ནོ།
en: “Ānanda, if he is thus, he is said to have meditated on the four applications of mindfulness.” II. Ahicchattra

source: །དེ་ནས་བཅོམ་ལྡན་འདས་རི་འོར་ཞིག་ཏུ་བྱོན་ཏོ། །རི་འོར་དེ་ན་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོའི་ཞང་པོ་དྲང་སྲོང་རྣམས་ཀྱི་ནང་དུ་རབ་ཏུ་བྱུང་བ་དེ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་འདུལ་བར་འགྱུར་བས།
en: Then the Blessed One arrived at a hamlet, wherein was the venerable Mahā­maudgalyāyana’s uncle, who had gone forth among ṛṣis.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ།
en: Since the Blessed One thought that the venerable Mahā­maudgalyāyana ought to convert this ṛṣi, he instructed the venerable Mahā­maudgalyāyana, “Maudgalyāyana, think about your uncle.”

source: མཽད་གལ་གྱི་བུ་ཞང་པོ་ལ་སོམས་ཤིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ཏེ།
en: “Certainly, O Honored One,” replied the venerable Mahā­maudgalyāyana to the Blessed One.

source: དེའི་གདུལ་བའི་དུས་ཤེས་ནས་དྲང་སྲོང་རྣམས་ཀྱི་བསྟི་གནས་སུ་འཇུག་པར་བརྩམས་སོ།
en: He knew the time to convert his uncle had come and tried to enter the hermitage of the ṛṣis.

source: །དེ་ནས་དྲང་སྲོང་དེས་སྨྲས་པ།
en: Then the ṛṣi said, “O śramaṇa, stop.

source: དགེ་སྦྱོང་འདུག་ཤིག །བྲམ་ཟེ་རྣམས་ཀྱི་བསྟི་གནས་འདིར་མ་འཇུག་ཤིག །དེས་སྨྲས་པ། ང་ཡང་བྲམ་ཟེ་ཡིན་ནོ།
en: You should not enter this hermitage of brahmins.” “I am a brahmin, too,” replied the venerable Mahā­maudgalyāyana.

source: །དྲང་སྲོང་དེས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The ṛṣi then spoke a verse:

source: བྲམ་ཟེ་ཁྱོད་ལ་བསང་བྱེད་མེད།
en: “O brahmin, you have neither the sacred grass

source: །བླུགས་གཟར་ཡང་ནི་ཡོད་མ་ཡིན།
en: Nor a ladle for burnt offerings.

source: །ཁྱོད་ནི་མགོ་རེག་མེ་མཆོད་མིན།
en: You are bald and you do not perform fire offerings.

source: །བྲམ་ཟེ་བདག་ཅེས་ཅི་སྟེ་སྨྲ།
en: Why do you say that you are a brahmin?”

source: །ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་ཀྱང་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The venerable Mahā­maudgalyāyana spoke some verses in reply:

source: བྲམ་ཟེ་ང་ཡི་ངོ་ཚ་ཤེས།
en: “O brahmin, it is my sacred grass To know shame;

source: །བསང་བྱེད་བླུགས་གཟར་ཤེས་རབ་ཉིད།
en: my ladle is my knowledge;

source: །ཆུ་རྒྱུན་རྟག་འབབ་དད་པ་ནི། །ང་ཡི་རིལ་བ་སྤྱི་བླུགས་ཡིན། །ནང་དུ་ལེགས་པར་མཉམ་བཞག་པའི།
en: My faith, which is like constantly flowing water, Is my water jar;

source: །བདེན་པ་ཁོ་བོ་མེ་མཆོད་དེ།
en: “The truth is my fire offering, I who am well concentrated within.

source: །ཡང་དག་སྡོམ་དང་དུལ་བ་ཡིས།
en: Correctly restrained and self-controlled,

source: །ཉིན་མཚན་དུ་ནི་སྦྱིན་སྲེག་བྱེད།
en: I burn offerings by day and by night.”

source: །གལ་ཏེ་དེ་ལྟར་གྱུར་ན་ཡང་དགེ་སྦྱོང་མགོ་རེག་ལ་ནི་འདིར་སྐབས་མི་འབྱེད་དོ།
en: “Even if that is so,” said the ṛṣi, “a shaven-headed śramaṇa is not permitted here.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་རླུང་དང་ཆར་དྲག་བཏང་ནས་མཚོ་བྲན་དང་ཉེ་བ་ཞིག་ཏུ་སོང་ནས་ཤིང་ཞིག་གི་དྲུང་དུ་རྟེན་ཅིང་འདུག་གོ།
en: Then the venerable Mahā­maudgalyāyana caused a storm. He went near a lake, approached a tree, and sat under it.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོའི་འཁོར་ཞིག་གནས་པ་དེས་བསམས་པ།
en: There lived an attendant of the nāga kings Nanda and Upananda.

source: འདི་ནི་འཕགས་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཡིན་ཏེ། ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོ་གཉིས་ཀྱིས་བླ་མར་བྱ་བ་ཡིན་གྱིས།
en: The nāga thought, “This is the noble one Mahā­maudgalyāyana, whom the nāga kings Nanda and Upananda respect.

source: མ་ལ་བདག་གིས་འདིའི་མཆོད་པ་བྱ་བ་ལ་བརྩོན་པར་བྱའོ་སྙམ་སྟེ། ཀླུ་དེ་གནས་ནས་བྱུང་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོའི་ལུས་ལ་ལན་བདུན་དུ་དཀྲིས་ཏེ་སྟེང་ནས་མགོའི་གདེངས་ཀ་ཆེན་པོ་བྱས་ནས་འདུག་གོ།
en: Now I will make an effort to venerate him.” The nāga left his residence and sat, encircling the venerable Mahā­maudgalyāyana’s body seven times and raising his hood over the venerable Mahā­maudgalyāyana’s head.

source: །དྲང་སྲོང་རྣམས་ཀྱི་ཆོས་ཉིད་ཀྱིས་གལ་ཏེ་སྡུག་བསྔལ་ལ་མ་བསམས་ན་དྲང་སྲོང་གི་ཆོས་ལས་ཉམས་པར་འགྱུར་བས་དེ་ནས་དྲང་སྲོང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: It is commonplace among ṛṣis that if one is not concerned about another’s pain, one ceases being a ṛṣi.

source: རབ་ཏུ་བྱུང་བ་དེ་རླུང་དང་ཆར་དྲག་གིས་ཉེན་ནས་ཤི་བར་གྱུར་ཏེ། བདག་དྲང་སྲོང་གི་ཆོས་ལས་ཉམས་པར་གྱུར་ན་མི་རུང་ངོ་སྙམ་ནས། དེ་ནས་བསྟི་གནས་དེ་ནས་ཕྱིར་བྱུང་སྟེ།
en: Therefore, the ṛṣi thought, “If that mendicant dies in the storm and I cease being a ṛṣi, that would not be appropriate.” He then left the hermitage and tried to find him.

source: བལྟ་བར་བརྩམས་པ་ན། དེས་དེ་མཐོང་ནས་སྨྲས་པ། ཀྱེ་རབ་ཏུ་བྱུང་བ་ཁོ་བོ་ཅག་གི་བསྟི་གནས་སུ་ཞུགས་ཤིག །དེས་སྨྲས་པ།
en: He saw the venerable Mahā­maudgalyāyana and said, “O mendicant, enter our hermitage.”

source: དྲང་སྲོང་ཆེན་པོ་ཁྱོད་དྲང་སྲོང་གི་ཆོས་དེ་ལས་ཉམས་པར་གྱུར་ཏམ།
en: “O great ṛṣi, did you cease being a ṛṣi?” asked the venerable Mahā­maudgalyāyana.

source: དྲང་སྲོང་དེས་དེའི་ང་རོ་ལས་ངོ་ཤེས་ནས་སྨྲས་པ། འཕགས་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལགས་སམ།
en: The ṛṣi recognized his voice and asked in return, “Are you the noble one Mahā­maudgalyāyana?”

source: དྲང་སྲོང་བདག་སྐྱེ་བོས་དེ་ལྟར་ཤེས་སོ།
en: “O ṛṣi, people know me thus.”

source: །འཕགས་པ་དོན་ཅི་ཞིག་ལ་བྱོན།
en: “O noble one, for what purpose did you come here?”

source: ཁྱོད་ཉིད་ཀྱི་གདུལ་བའི་དུས་ཤེས་ནས་འོངས་སོ་ཚུར་སྤྱོན་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་བཞུད་དོ།
en: “I came for the very purpose of your conversion. Now let us go to the Blessed One.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་ཞང་པོ་ཁྲིད་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས།
en: The venerable Mahā­maudgalyāyana then took his uncle to the Blessed One. When he had arrived, he bowed low until his forehead touched the Blessed One’s feet, and then he sat down to one side.

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་གི་ཞང་པོ་དྲང་སྲོང་གི་ནང་དུ་རབ་ཏུ་བྱུང་བ་འདི་ལགས་ན།
en: The venerable Mahā­maudgalyāyana said to the Blessed One, “This is my uncle, who has gone forth among ṛṣis.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་ལ་ཆོས་བཤད་པའི་རིགས་སོ།
en: The Blessed One should preach the Dharma for him.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་མཐུན་པའི་ཆོས་བཤད་པ་མཛད་དེ།
en: The Blessed One knew the ṛṣi’s thinking, proclivity, disposition, and nature and preached the Dharma that was appropriate for him.

source: དེ་ཐོས་པས་དྲང་སྲོང་དེས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ནས་དེ་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་འཐོབ་པ་ལྟ་ན།
en: Having heard the Dharma, the ṛṣi actualized the fruit of a never-returner. He rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to him, “O Honored One, I wish to go forth and be ordained a monk in the well-taught Dharma and Vinaya.

source: བདག་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: I will lead the pure life in the presence of the Blessed One.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དགེ་སློང་ཚུར་ཤོག་ཞེས་བྱ་བས་རབ་ཏུ་ཕྱུང་ངོ་ཞེས་བྱ་བ་ནས།
en: The Blessed One ordained him by saying “Come, monk,” . . . .

source: དེ་བཞིན་གཤེགས་པས་ཚུར་ཤོག་བཀའ་སྩལ་པས།
en: Because the Tathāgata said “Come,”

source: སྐྲ་བྱི་སྣམ་སྦྱར་གྱོན་པའི་ལུས་ལྡན་ཞིང་།
en: His hair fell out and he was clad in his outer robe,

source: །སངས་རྒྱས་དགོངས་པས་ལུས་གཟུགས་བཀབ་པར་གྱུར། །ཅེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: And his body swathed in the Buddha’s mind.

source: །ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་སོང་བ་དང་། ཀླུ་གཞོན་ནུ་དེ་གནས་དེ་ན་གཅིག་ཏུ་མི་དགའ་བར་གྱུར་ནས།
en: When the venerable Mahā­maudgalyāyana had left, the nāga felt lonely and unhappy.

source: དེ་ནས་རི་འོར་དེར་ཡམས་ཀྱི་ནད་དག་བཏང་སྟེ། བདག་ཉིད་དྲང་སྲོང་གི་ཆ་བྱད་དུ་མངོན་པར་སྤྲུལ་ནས་བསྟི་གནས་དེར་སོང་སྟེ་གནས་སོ།
en: He caused various epidemics in the hamlet and, dressed as a ṛṣi, went to the hermitage and dwelled there.

source: །དེ་ནས་རི་འོར་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་དེ་བསྟི་གནས་དེར་ལྷགས་ནས་དེ་རྣམས་ཀྱིས་སྨྲས་པ། དྲང་སྲོང་ཆེན་པོ་བདག་ཅག་ལ་ཡམས་ཀྱི་ནད་བྱུང་ན་བདག་ཅག་གིས་ཇི་ལྟར་བགྱི།
en: Then the people of the hamlet came to the hermitage and said, “O great ṛṣi, such epidemics have befallen us. What should we do?”

source: དྲང་སྲོང་གིས་སྨྲས་པ། ཕྱོགས་འདི་ཉིད་དུ་ཤོག་ལ་འདུག་ཤིག་དང་། ཞི་བར་འགྱུར་རོ།
en: “Come and stay in this place,” replied the ṛṣi, “and the epidemics will be quelled.”

source: །དེ་ནས་རི་འོར་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་དེ་ཕྱོགས་དེར་ལྷགས་ནས་གནས་སོ།
en: The people of the hamlet then went to that place and dwelled there.

source: །ཕྱོགས་དེར་སྦྲུལ་གྱིས་གདུགས་བྱས་པས་སྦྲུལ་གདུགས་སྦྲུལ་གདུགས་ཞེས་བྱ་བར་གྲགས་ཏེ། དད་པ་ཅན་རྣམས་ཀྱིས་གཙུག་ལག་ཁང་ཡོ་བྱད་ཐམས་ཅད་ཡོད་པ་ཞིག་བརྩིགས་སོ།
en: Because the serpent (ahi) had served as an umbrella (chattra) there, the place became famous as Ahicchattra, and devout people built a monastery and provided it with all the requisites. III.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་མ་ཐུ་ལ་ན་འབབ་ཆུ་རབ་ཏུ་བཟང་ལྡན་ཞེས་བྱ་བའི་འགྲམ་སློབ་པ་རྣམས་ཀྱི་ཨ་མྲའི་ཚལ་ན་བཞུགས་སོ།
en: Mathurā The Buddha, the Blessed One, arrived in Mathurā and stayed in the mango forest of practitioners undergoing training on the bank of the river Prabhadrikā.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་བདག་ཉིད་གླིང་དང་། བདག་ཉིད་སྐྱབས་དང་། ཆོས་ཀྱི་གླིང་དང་། ཆོས་ཀྱི་སྐྱབས་ལ་གནས་པར་བྱའི། གླིང་གཞན་མ་ཡིན། སྐྱབས་གཞན་མ་ཡིན་ནོ།
en: Then the Blessed One said to the monks, “Monks, you should rely on the island that is yourself, the refuge that is yourself, the island that is the Dharma, the refuge that is the Dharma, and not on other islands or other refuges.

source: །དགེ་སློང་དག་ཁྱེད་ཀྱིས་བདག་ཉིད་གླིང་དང་། བདག་ཉིད་སྐྱབས་དང་། ཆོས་ཀྱི་གླིང་དང་། ཆོས་ཀྱི་སྐྱབས་ཀྱིས་གནས་པར་བྱའི། གླིང་གཞན་མ་ཡིན་ཞིང་སྐྱབས་གཞན་མ་ཡིན་པ་འདི་ལ་སོ་སོར་ཡང་དག་པར་བསླབ་པར་བྱའོ།
en: Monks, you should correctly learn that you should rely on the island that is yourself, the refuge that is yourself, the island that is the Dharma, the refuge that is the Dharma, and not on other islands or other refuges.

source: །མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ནི་ཇི་ལྟ་བུ་ཞིག་ཡིན། གང་ཞིག་ཡོད་ན་ཅི་ལ་བརྟེན་ནས་ཅི་ལ་མངོན་པར་ཞེན་ཏེ།
en: “What are sorrow, lamentation, pain, despair, and distress like?

source: བདག་ནི་ཅི་ཡིན་ཞེས་རྗེས་སུ་ལྟ་བ་རྣམས་ལ་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་གང་དག་མ་སྐྱེས་པ་ནི་སྐྱེ་ཞིང་སྐྱེས་པ་རྣམས་ནི་ཕྱིར་ཞིང་འཕེལ་ཞིང་རྒྱས་པར་འགྱུར།
en: Being attached to something, people observe it as self, and hence, on account of it, sorrow, lamentation, pain, despair, and distress that have not yet arisen will arise for these people, and such things that have already arisen will increase and grow. Why is this?”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ནི་ཆོས་རྣམས་ཀྱི་རྩ་བ་ལགས། བཅོམ་ལྡན་འདས་ནི་འདྲེན་པ་ལགས། བཅོམ་ལྡན་འདས་ནི་སྟོན་པ་ལགས་པས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་དགེ་སློང་རྣམས་ལ་བཤད་ན།
en: “O Honored One, since the Blessed One is the root of the Dharma, the Blessed One is the Leader, and the Blessed One is the Teacher, may the Blessed One teach the meaning of this to the monks.

source: བཅོམ་ལྡན་འདས་ལས་དགེ་སློང་རྣམས་ཀྱིས་ཐོས་ནས་འཛིན་པར་འགྱུར་ལགས་སོ།
en: The monks will listen to it from the Blessed One and grasp it.”

source: །དགེ་སློང་དག་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: “O monks, then listen to it well and keep it in mind; I shall teach it.

source: །དགེ་སློང་དག་གཟུགས་ཡོད་ན་གཟུགས་ལ་བརྟེན་ནས་གཟུགས་ལ་མངོན་པར་ཞེན་ཏེ། གཟུགས་ནི་བདག་ཡིན་ནོ་ཞེས་རྗེས་སུ་ལྟ་བ་རྣམས་ལ་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་གང་དག་མ་སྐྱེས་པ་ནི་སྐྱེ་ཞིང་སྐྱེས་པ་རྣམས་ནི་ཕྱིར་ཞིང་འཕེལ་ཞིང་རྒྱས་པར་འགྱུར།
en: “O monks, when there are visual objects and people are attached to visual objects and observe visual objects as self, sorrow, lamentation, pain, despair, and distress that have not yet arisen will arise for these people, and such things that have already arisen will increase and grow.

source: དགེ་སློང་དག་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡོད་ན། རྣམ་པར་ཤེས་པ་ལ་བརྟེན་ནས་རྣམ་པར་ཤེས་པ་ལ་མངོན་པར་ཞེན་ཏེ་རྣམ་པར་ཤེས་པ་ནི་བདག་ཡིན་ནོ་ཞེས་རྗེས་སུ་ལྟ་བ་རྣམས་ལ་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་གང་དག་མ་སྐྱེས་པ་ནི་སྐྱེ་ཞིང་སྐྱེས་པ་རྣམས་ནི་ཕྱིར་ཞིང་འཕེལ་ཞིང་རྒྱས་པར་འགྱུར་རོ། །དགེ་སློང་དག་ཁྱེད་ཀྱིས་ལྟོས་ཤིག་ཅེས་བྱ་བ་ནས། དྲན་བཞིན་དུ་དབུགས་བརྔུབས་ན་བརྔུབས་སོ་ཞེས་སློབ་སྟེ། ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་ལྟའོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “O monks, when there are feeling, perception, formations, and consciousness, and people are attached to consciousness and observe consciousness as self, sorrow, lamentation, pain, despair, and distress that have not yet arisen will arise for these people, and such things that have already arisen will increase and grow.

source: །དེའི་ཚེ་འཕགས་པའི་ཉན་ཐོས་ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་ཞིང་གནས་སོ།
en: “O monks, look . . . . When . . . he knows that he has breathed in, observing perception in perception, the noble disciple dwells, observing perception in perception.

source: དཔེར་ན་ཀུན་དགའ་བོ་ལམ་པོ་ཆེའི་བཞི་མདོར་རྡུལ་གྱི་མཆོད་རྟེན་ཞིག་བརྩིགས་པར་གྱུར་ལ་ལྷོ་ཕྱོགས་ནས་བཞོན་པ་ཅན་ནམ། ཁྱོགས་སམ། ཤིང་རྟས་འཁྱམ་པ་འོངས་ན་ཞེས་བྱ་བ་ནས། ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་ལྟའོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Suppose, for instance, Ānanda, a stūpa is built out of dirt at the crossroads of main streets and then someone roaming by vehicle, palanquin, or chariot comes there from the south . . . observing perception in perception.

source: །གང་གི་ཚེ་འཕགས་པའི་ཉན་ཐོས་སེམས་སོ་སོར་མྱོང་བ་དང་སེམས་རབ་ཏུ་དགའ་བ་དང་། སེམས་མཉམ་པར་འཇོག་པ་དང་སེམས་རྣམ་པར་གྲོལ་བར་བྱེད་ཅིང་དབུགས་བརྔུབས་སོ་ཞེས་སློབ་པ་དང་། སེམས་རྣམ་པར་གྲོལ་བར་བྱེད་ཅིང་དབུགས་ཕྱུང་ན་སེམས་རྣམ་པར་གྲོལ་བར་བྱེད་ཅིང་དབུགས་ཕྱུང་ངོ་ཞེས་སློབ་སྟེ། སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་བ་དེའི་ཚེ་འཕགས་པའི་ཉན་ཐོས་སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་སོ།
en: “When a noble disciple knows that he has experienced his mind and breathed in, with his mind pleased, concentrated, and liberated, and, having breathed out with his mind liberated, knows that he has breathed out with his mind liberated and observes his mind in his mind, the noble disciple dwells, observing his mind in his mind.

source: །དེའི་ཚེ་འཕགས་པའི་ཉན་ཐོས་གནས་པ་ན་ནང་གི་ཡིད་ལ་བྱེད་པ་ཡོད་པར་ཤེས་སོ། །དཔེ་ནི་ནུབ་ཕྱོགས་ནས་ཁྱོགས་འོང་བ་དེ་ཉིད་བྱའོ།
en: When he thus dwells, the noble disciple knows that his mind is concentrated inwardly.” (The parable of the stūpa and a vehicle, and so forth, from the west should be narrated here.)

source: །དེ་ལུས་དེ་དང་ཚོར་བ་དེ་དང་སེམས་དེ་ལ་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་དེ་དག་ནུབ་པས་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་བཏང་སྙོམས་སུ་གནས་སོ། །དེའི་ཚེ་འཕགས་པའི་ཉན་ཐོས་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་སོ།
en: “Because both his longing and despair have disappeared in the body, perception, and mind, he dwells in equanimity, observing mental objects in mental objects.

source: འདི་ལྟ་སྟེ་ལམ་པོ་ཆེའི་བཞི་མདོར་རྡུལ་གྱི་མཆོད་རྟེན་ཞིག་བརྩིགས་པར་གྱུར་ལ། དེ་ནས་བྱང་ཕྱོགས་ནས་ནི་བཞོན་པ་ཅན་ནམ། ཁྱོགས་སམ། ཤིང་རྟས་འཁྱམ་པ་འོངས་ན། ཀུན་དགའ་བོ་ཇི་སྙམ་དུ་སེམས།
en: Suppose, for instance, a stūpa is built out of dirt at the crossroads of main streets and then someone roaming by vehicle, palanquin, or chariot comes there from the north, will the dirt stūpa disintegrate?

source: བཙུན་པ་དེ་ལྟར་འགྱུར་ལགས་སོ་ཞེས་བྱ་བ་ནས་དེ་ལྟར་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟའོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “In the same way . . . observing mental objects in mental objects.

source: ཀུན་དགའ་བོ་དེ་ལྟར་ན་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་བརྟེན་ནས་བསྒོམས་པ་ཡིན་ནོ།
en: “Ānanda, if he is thus, he is said to have meditated on the four applications of mindfulness.” IV. Rāṣṭrapāla

source: །བཅོམ་ལྡན་འདས་ཡུལ་སྒྲ་ངན་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན། བང་མཛོད་སྟུག་པོ་ཅན་དུ་བྱོན་ནས། བང་མཛོད་སྟུག་པོ་ཅན་ན་བང་མཛོད་སྟུག་པོ་ཅན་གྱི་ཚལ་ན་བཞུགས་སོ།
en: The Blessed One, traveling through the country of Kuru, arrived in Sthūlakoṣṭhaka, and stayed in Sthūlakoṣṭhaka Forest near Sthūlakoṣṭhaka.

source: །བང་མཛོད་སྟུག་པོ་ཅན་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཡུལ་སྒྲ་ངན་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་བང་མཛོད་སྟུག་པོ་ཅན་དུ་བྱོན་ནས། བང་མཛོད་སྟུག་པོ་ཅན་ན་བང་མཛོད་སྟུག་པོའི་ཚལ་ན་བཞུགས་སོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་ཚོགས་ནས་ཚོགས་དང་། ཁྱུ་ནས་ཁྱུར་འདུས་ཤིང་ཕྲད་ནས་བང་མཛོད་སྟུག་པོ་ཅན་ནས་བྱུང་སྟེ།
en: When the brahmins and householders in Sthūlakoṣṭhaka heard that the Blessed One, traveling through the country of Kuru, had arrived in Sthūlakoṣṭhaka and was staying in Sthūlakoṣṭhaka Forest near Sthūlakoṣṭhaka, they met together, flocked together, left Sthūlakoṣṭhaka, and went to the Blessed One.
